app/controllers/addresses_controller.rb

SELECT * FROM `addresses`
---
  def index
    #@addresses = Address.all

    if(params)

      searchparams={}

      if(params[:address_id])
        addr=Address.find(params[:address_id])
        searchparams[:origin]=addr
      elsif params[:lat] && params[:lng]
        #addr=Address.find(:lat=>params[:lat],:lng=>params[:lng])
        searchparams[:origin]=[params[:lat],params[:lng]]
      end

      if(params[:within])
        searchparams[:within]=params[:within]
      end

      if params[:s] && params[:w] && params[:n] && params[:e]
        sw_point=[params[:s],params[:w]]
        ne_point=[params[:n],params[:e]]
        searchparams[:bounds]=[sw_point,ne_point]
      end

      addrlist={}
      Address.all(searchparams).each { |a|