app/controllers/businesses_controller.rb

SELECT * FROM `businesses` ORDER BY created_at DESC LIMIT 0, 10
---
  def index
    #page = params[:page] || 1
#@posts = Post.paginate_by_board_id @board.id, :page => page, :order => 'updated_at DESC'
    @businesses = Business.paginate :page => params[:page], :order => 'created_at DESC', :include => [:user,:address]